---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsLanding.GetStairsPath
source: html/9b7d51c5-1a8c-62d9-4aa4-e7dd1bfe8090.htm
---
# Autodesk.Revit.DB.Architecture.StairsLanding.GetStairsPath Method

Returns the stairs path curves on the landing. The curves are projected on the stairs base level.

## Syntax (C#)
```csharp
public CurveLoop GetStairsPath()
```

## Returns
The stairs path curves of the landing.